# Solution: Challenge Week 02

## Libraries and settings

In [13]:
# Libraries
import os
import json
import numpy as np
import pandas as pd
from tabulate import tabulate

# API credentials for Kaggle
with open('kaggle.json') as f:
    data = json.load(f)

os.environ['KAGGLE_USERNAME'] = data['username']
os.environ['KAGGLE_KEY'] = data['key']

from kaggle.api.kaggle_api_extended import KaggleApi

# Ignore warnings
import warnings
warnings.filterwarnings('ignore')

# Show current working directory
print(os.getcwd())

u:\Lektionen\GitHub_Repositories\scientific_programming\Week_02\challenge

## Initialize the Kaggle API

In [14]:
# Initialize API
api = KaggleApi()
api.authenticate()

## Use the Kaggle Web API to download the Titanic data set

In [15]:
# Download file
api.dataset_download_file('yasserh/titanic-dataset','Titanic-Dataset.csv')

# Read data to pandas data frame
df = pd.read_csv('Titanic-Dataset.csv', sep=',')
df.head()

Dataset URL: https://www.kaggle.com/datasets/yasserh/titanic-dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Identify the data types in the Titanic data set

In [16]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Transform variable 'Sex' (Gender) to a two-column matrix with (0/1) values

In [17]:
# Use the get_dummies() method from pandas for conversion
df_02 = pd.get_dummies(df, drop_first=False, columns=['Sex'], dtype='int')
df_02.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_female,Sex_male
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,1,0
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,0,1

## Create a subset of the Titanic data which includes:
- passengers which have survived AND
- female passengers which were older than 45 years OR 
- male passengers which were younger than 20 years

In [18]:
# Create subset
df_sub = df_02.loc[(df_02['Survived'] == 1) & 
                (((df_02['Sex_female'] == 1) & (df_02['Age'] >= 45)) | 
                 ((df_02['Sex_male'] == 1) & (df_02['Age'] < 20)))
                 ].reset_index(drop=True)

# Show subset
df_sub.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_female,Sex_male
0,12,1,1,"Bonnell, Miss. Elizabeth",58.00,0,0,113783,26.5500,C103,S,1,0
1,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",55.00,0,0,248706,16.0000,NaN,S,1,0
2,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",49.00,1,0,PC 17572,76.7292,D33,C,1,0
3,79,1,2,"Caldwell, Master. Alden Gates",0.83,0,2,248738,29.0000,NaN,S,0,1
4,126,1,3,"Nicola-Yarred, Master. Elias",12.00,1,0,2651,11.2417,NaN,C,0,1

## Answer the question: How many passengers were selected?

In [19]:
# Using an f-string for formatting and to provide the answer
print(f'Using the selection above, a number of {df_sub.shape[0]} passengers were selected.')

Using the selection above, a number of 55 passengers were selected.

### Jupyter notebook --footer info-- (please always provide this at the end of each notebook)

In [20]:
import os
import platform
import socket
from platform import python_version
from datetime import datetime

print('-----------------------------------')
print(os.name.upper())
print(platform.system(), '|', platform.release())
print('Datetime:', datetime.now().strftime("%Y-%m-%d %H:%M:%S"))
print('Python Version:', python_version())
print('-----------------------------------')

-----------------------------------
NT
Windows | 10
Datetime: 2025-02-27 13:10:05
Python Version: 3.11.10
-----------------------------------